app/controllers/posts_controller.rb

  def index
    @posts = @bulletin.posts.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."bulletin_id" = $1  [["bulletin_id", 11]]

  def create
    @post = @bulletin.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "bulletin_id", "picture") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "구름이"], ["content", "예쁜 우리 구름이 발"], ["created_at", 2016-12-23 14:00:04 +0900], ["updated_at", 2016-12-23 14:00:04 +0900], ["bulletin_id", 15], ["picture", "DSC01631.JPG"]]

    def set_bulletin
      @bulletin = Bulletin.find(params[:bulletin_id])
---
SELECT  "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    def set_post
      @post = @bulletin.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."bulletin_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["bulletin_id", 11], ["id", 10], ["LIMIT", 1]]